const types  = {
    MIN_YEAR : 1899,
    MAX_YEAR : 2100,
    /**
	 * 1899 - 2100 年的农历数据
	 * 
	 * 数据格式: 0x04bd8是5个16进制数,20bit的数,代表公历日期为 1900年01月31日,农历日期为1900年01月01日
	 * 
	 * 说明：农历中大月为30天,小月为29天
	 * 
	 * 前4位(即0): 表示当年润月的大小月,为1则润大月,为0则润小月。
	 * 中间12位(即4bd): 每位代表一个月,为1则为大月,为0则为小月。12位表示1到12个月
	 * 后4位(即8): 代表这一年的润月月份,为0则不润。首4位要与末4位搭配使用
	*/
	lunarInfo : [ 0x0ab50,//1899
        0x04bd8,0x04ae0,0x0a570,0x054d5,0x0d260,0x0d950,0x16554,0x056a0,0x09ad0,0x055d2,//1900-1909
        0x04ae0,0x0a5b6,0x0a4d0,0x0d250,0x1d255,0x0b540,0x0d6a0,0x0ada2,0x095b0,0x14977,//1910-1919
        0x04970,0x0a4b0,0x0b4b5,0x06a50,0x06d40,0x1ab54,0x02b60,0x09570,0x052f2,0x04970,//1920-1929
        0x06566,0x0d4a0,0x0ea50,0x06e95,0x05ad0,0x02b60,0x186e3,0x092e0,0x1c8d7,0x0c950,//1930-1939
        0x0d4a0,0x1d8a6,0x0b550,0x056a0,0x1a5b4,0x025d0,0x092d0,0x0d2b2,0x0a950,0x0b557,//1940-1949
        0x06ca0,0x0b550,0x15355,0x04da0,0x0a5b0,0x14573,0x052b0,0x0a9a8,0x0e950,0x06aa0,//1950-1959
        0x0aea6,0x0ab50,0x04b60,0x0aae4,0x0a570,0x05260,0x0f263,0x0d950,0x05b57,0x056a0,//1960-1969
        0x096d0,0x04dd5,0x04ad0,0x0a4d0,0x0d4d4,0x0d250,0x0d558,0x0b540,0x0b6a0,0x195a6,//1970-1979
        0x095b0,0x049b0,0x0a974,0x0a4b0,0x0b27a,0x06a50,0x06d40,0x0af46,0x0ab60,0x09570,//1980-1989
        0x04af5,0x04970,0x064b0,0x074a3,0x0ea50,0x06b58,0x055c0,0x0ab60,0x096d5,0x092e0,//1990-1999
        0x0c960,0x0d954,0x0d4a0,0x0da50,0x07552,0x056a0,0x0abb7,0x025d0,0x092d0,0x0cab5,//2000-2009
        0x0a950,0x0b4a0,0x0baa4,0x0ad50,0x055d9,0x04ba0,0x0a5b0,0x15176,0x052b0,0x0a930,//2010-2019
        0x07954,0x06aa0,0x0ad50,0x05b52,0x04b60,0x0a6e6,0x0a4e0,0x0d260,0x0ea65,0x0d530,//2020-2029
        0x05aa0,0x076a3,0x096d0,0x04bd7,0x04ad0,0x0a4d0,0x1d0b6,0x0d250,0x0d520,0x0dd45,//2030-2039
        0x0b5a0,0x056d0,0x055b2,0x049b0,0x0a577,0x0a4b0,0x0aa50,0x1b255,0x06d20,0x0ada0,//2040-2049
        0x14b63,0x09370,0x049f8,0x04970,0x064b0,0x168a6,0x0ea50,0x06b20,0x1a6c4,0x0aae0,//2050-2059
        0x0a2e0,0x0d2e3,0x0c960,0x0d557,0x0d4a0,0x0da50,0x05d55,0x056a0,0x0a6d0,0x055d4,//2060-2069
        0x052d0,0x0a9b8,0x0a950,0x0b4a0,0x0b6a6,0x0ad50,0x055a0,0x0aba4,0x0a5b0,0x052b0,//2070-2079
        0x0b273,0x06930,0x07337,0x06aa0,0x0ad50,0x14b55,0x04b60,0x0a570,0x054e4,0x0d160,//2080-2089
        0x0e968,0x0d520,0x0daa0,0x16aa6,0x056d0,0x04ae0,0x0a9d4,0x0a2d0,0x0d150,0x0f252,//2090-2099
        0x0d520] , //2100

    // 二十四节气数据，节气点时间(单位是分钟)从0小寒起算
    termInfo : [0,21208,42467,63836,85337,107014,128867,150921,173149,195551,218072,240693,263343,285989,308563,331033,353350,375494,397447,419210,440795,462224,483532,504758] ,
    // 二十四节气
   solarTerm  : ['小寒','大寒','立春','雨水','惊蛰','春分','清明','谷雨','立夏','小满','芒种','夏至','小暑','大暑','立秋','处暑','白露','秋分','寒露','霜降','立冬','小雪','大雪','冬至'] ,

    // 农历月
   monthCN : ['正月','二月','三月','四月','五月','六月','七月','八月','九月','十月','十一月','十二月'] ,
    // 农历日
   dayCN : ['初一','初二','初三','初四','初五','初六','初七','初八','初九','初十','十一','十二','十三','十四','十五','十六','十七','十八','十九','二十','廿一','廿二','廿三','廿四','廿五','廿六','廿七','廿八','廿九','三十','卅一'] ,

    // 天干
   heavenlyStems : ['甲','乙','丙','丁','戊','己','庚','辛','壬','癸'] ,
    // 地支
   earthlyBranches : ['子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥'] ,
    // 地支十二生肖
   chinaZodiac : ['鼠','牛','虎','兔','龙','蛇','马','羊','猴','鸡','狗','猪'] ,

    // 星期
   weekend : ['星期一','星期二','星期三','星期四','星期五','星期六','星期日'] ,

    // 国内传统节日
    domesticFestival : {
        'd0101':'春节 ',
        'd0115':'元宵节',
        'd0202':'龙头节',
        'd0505':'端午节',
        'd0707':'七夕节',
        'd0715':'中元节',
        'd0815':'中秋节',
        'd0909':'重阳节',
        'd1001':'寒衣节',
        'd1015':'下元节',
        'd1208':'腊八节',
        'd1223':'小年'
    },

    // 国际节日
    interFestival : {
        'i0202':'湿地日,1996',
        'i0308':'妇女节,1975',
        'i0315':'消费者权益日,1983',
        'i0401':'愚人节,1564',
        'i0422':'地球日,1990',
        'i0501':'劳动节,1889',
        'i0512':'护士节,1912',
        'i0518':'博物馆日,1977',
        'i0605':'环境日,1972',
        'i0623':'奥林匹克日,1948',
        'i1020':'骨质疏松日,1998',
        'i1117':'学生日,1942',
        'i1201':'艾滋病日,1988',
        'i0101':'元旦',
        'i0312':'植树节,1979',
        'i0504':'五四青年节,1939',
        'i0601':'儿童节,1950',
        'i0701':'建党节,1941',
        'i0801':'建军节,1933',
        'i0903':'抗战胜利日,1945',
        'i0910':'教师节,1985',
        'i1001':'国庆节,1949',
        'i1224':'平安夜',
        'i1225':'圣诞节',
        'i0214':'情人节',
        'i0520':'母亲节,1913',
        'i0618':'父亲节',
        'i1144':'感恩节'
    }
}


export default types ;